### Pandas-DataFrame and Series

Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. it provides two primary data structures: Series and DataFrame. 
A series is one-dimentional array-like object, while a DataFrame is a two-dimentional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns)

In [2]:
import pandas as pd

data=[10,20,30,40,50]
series=pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
## Create a Series from dictionary
data={'a':1, 'b':2, 'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index)

a    10
b    20
c    30
dtype: int64

In [7]:
## DataFrame 
## create a Dataframe from a dictionary of list

data={
    'Name':['Ibraheem','Ashiq','Safiullah'],
    'Age':[25,30,45],
    'Universities':['Jeju','Inje','Ewah Women University']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

        Name  Age           Universities
0   Ibraheem   25                   Jeju
1      Ashiq   30                   Inje
2  Safiullah   45  Ewah Women University
<class 'pandas.core.frame.DataFrame'>

In [9]:
## Create a Data frame from a List of Dictionaries
data = [
    {'Name':'Ibraheem','Age':23,'City':'Mardan'},
    {'Name':'Safiullah','Age':23,'City':'Peshawar'},
    {'Name':'Sawab','Age':22,'City':'Kurram Agency'},
    {'Name':'Ashiq','Age':22,'City':'Mardan'},
    {'Name':'Fahad','Age':29,'City':'Malakand'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

        Name  Age           City
0   Ibraheem   23         Mardan
1  Safiullah   23       Peshawar
2      Sawab   22  Kurram Agency
3      Ashiq   22         Mardan
4      Fahad   29       Malakand
<class 'pandas.core.frame.DataFrame'>

In [10]:
## Accessing data 
df['Name']

0     Ibraheem
1    Safiullah
2        Sawab
3        Ashiq
4        Fahad
Name: Name, dtype: object

In [11]:
df.loc[0]

Name    Ibraheem
Age           23
City      Mardan
Name: 0, dtype: object

In [12]:
df.loc[1]

Name    Safiullah
Age            23
City     Peshawar
Name: 1, dtype: object

In [13]:
df.loc[2]

Name            Sawab
Age                22
City    Kurram Agency
Name: 2, dtype: object

In [14]:
df.loc[3]

Name     Ashiq
Age         22
City    Mardan
Name: 3, dtype: object

In [15]:
df.iloc[0]

Name    Ibraheem
Age           23
City      Mardan
Name: 0, dtype: object

In [16]:
df.loc[0]

Name    Ibraheem
Age           23
City      Mardan
Name: 0, dtype: object

In [19]:
df.loc[0][0:2]

Name    Ibraheem
Age           23
Name: 0, dtype: object

In [20]:
df.at[2,'Name']

'Sawab'

In [22]:
df

        Name  Age           City
0   Ibraheem   23         Mardan
1  Safiullah   23       Peshawar
2      Sawab   22  Kurram Agency
3      Ashiq   22         Mardan
4      Fahad   29       Malakand

In [30]:
df.at[4,'City']

'Malakand'

In [31]:
df.iat[4,2]

'Malakand'

In [44]:
#Adding a column
df['Salary'] = [50000,60000,70000,80000,90000]

In [34]:
df

        Name  Age           City  Salary
0   Ibraheem   23         Mardan   50000
1  Safiullah   23       Peshawar   60000
2      Sawab   22  Kurram Agency   70000
3      Ashiq   22         Mardan   80000
4      Fahad   29       Malakand   90000

In [39]:
## Remove a Column 
df.drop('Salary',axis=1,inplace=True)

In [40]:
df

        Name  Age           City
0   Ibraheem   23         Mardan
1  Safiullah   23       Peshawar
2      Sawab   22  Kurram Agency
3      Ashiq   22         Mardan
4      Fahad   29       Malakand

In [41]:
## Add age to the column
df['Age']=df['Age']+1

In [42]:
df

        Name  Age           City
0   Ibraheem   24         Mardan
1  Safiullah   24       Peshawar
2      Sawab   23  Kurram Agency
3      Ashiq   23         Mardan
4      Fahad   30       Malakand

In [45]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   24.800000  70000.000000
std     2.949576  15811.388301
min    23.000000  50000.000000
25%    23.000000  60000.000000
50%    24.000000  70000.000000
75%    24.000000  80000.000000
max    30.000000  90000.000000